{
  "main": {
    "name": "Piyush Tiwari",
    "shortDesc": "I am a Full-Stack developer based in Pune, India. I did by Bachelor's of Technology from University Institute of Technology, RGPV Bhopal, and my journey in web development began during my third year of college. I'm passionate about creating beautiful, functional, and user-friendly websites and applications, and I'm constantly pushing myself to learn and grow as a developer. Love building projects. Currently I'm an SDE intern in Bajaj Finserv Health, Pune",
    "titles": [
      "Frontend Development",
      "Backend Development",
      "Problem Solving"
    ],
    "heroImage": "https://img.freepik.com/free-psd/3d-illustration-person-with-sunglasses_23-2149436188.jpg",
    "techStackImages": [
      "https://img.icons8.com/color/100/null/nodejs.png",
      "https://img.icons8.com/color/48/null/spring-logo.png",
      "https://img.icons8.com/color/48/000000/express-js.png",
      "https://img.icons8.com/color/48/null/react-native.png"
    ]
  },
  "about": {
    "aboutImage": "https://img.freepik.com/free-psd/3d-illustration-person-with-sunglasses_23-2149436188.jpg",
    "aboutImageCaption": "<   I use my brain so you don't have to ;)  />",
    "title": "Full Stack Developer",
    "about" : "I am Piyush Tiwari, a Software Development Engineer at Bajaj Finserv Health Limited, based in Pune. With a B.Tech in Electronics & Communications Engineering from the University Institute of Technology, RGPV, I bring a solid foundation in engineering principles and a passion for technology. I have a proven track record of developing and optimizing backend systems using Java, Spring Boot, NestJS, and TypeScript, significantly enhancing system performance and reliability. My expertise extends to microservices, event-driven architecture, and scalable solutions with a strong focus on security and user experience. Additionally, I have hands-on experience with Kubernetes, Docker, and various databases including MongoDB and PostgreSQL. I enjoy solving complex programming problems and have excelled in numerous competitive programming contests. When I'm not coding, I love working on personal projects that challenge my skills and creativity.",
    "callUrl": "",
    "resumeUrl": "https://drive.google.com/file/d/1_NQV0v8aIcZCGnaCxIafjkHJICXO5VTU/view?usp=drive_link"
  },
  "socials": [
    {
      "icon": "FaLinkedin",
      "link": "https://www.linkedin.com/in/piyusht29/"
    },
    {
      "icon": "FaGithub",
      "link": "https://github.com/Drigger91"
    },
    {
      "icon": "FaInstagram",
      "link": "https://www.instagram.com/piyush_t29"
    }
  ],
  "skills": [
    {
      "name": "JavaScript",
      "image": "https://img.icons8.com/color/144/null/javascript--v1.png",
      "category": "Frontend"
    },
    {
      "name": "Firebase",
      "image": "https://img.icons8.com/color/144/null/firebase.png",
      "category": "Backend"
    },
    {
      "name": "GitHub",
      "image": "https://img.icons8.com/material-outlined/96/null/github.png",
      "category": "Tools"
    }
  ],
  "projects": [
    {
      "name": "Crypto App",
      "techstack": "ReactJS, Redux, JavaScript, Redux Toolkit",
      "category": "MERN Stack",
      "image": "https://media.geeksforgeeks.org/wp-content/cdn-uploads/20210114225740/10-Best-Web-Development-Project-Ideas-For-Beginners-in-2021.png",
      "links": {
        "code": "https://github.com/Drigger91",
        "video": "",
        "visit": ""
      }
    }
  ],
  "educations": [
    {
      "institute": "Sharda Vidya Mandir, Jhabua",
      "degree": "HSC Science",
      "duration": "2016 - 2018",
      "desc" : ["84%","School sports caption", "Selected twice for SGFI (School Games Federation of India)"]
    },
    {
      "institute": "University Institute of Technology,RGPV, Bhopal",
      "degree": "B.Tech ECE",
      "duration": "2019 - 2023",
      "desc": ["8.36/10 CGPA",
        "Pursuing ECE Engineering course from RGPV University",
        "Worked on integrated cirucits to make machines using c++ as programming language"
      ]
    }
  ],
  "experiences": [
    {
      "company": "Bajaj Finserv Health, Pune",
      "position": "Software Development Engineer",
      "duration": "July'2023 - Present",
      "desc": [
        "Driving impactful contributions to the Integration Layer module, an innovative, event-driven orchestration layer crafted in Java and Spring Boot. Empowering seamless issuance journeys for our Health-Tech products",
        " Independently developed a robust single sign-on microservice for partner integrations using NestJS, TypeScript, MongoDB, and Redis, achieving an API success rate and system uptime of 99.99%. This solution streamlines authentication processes, enhances security, and improves user experience across platforms.",
        " Successfully developed and optimized backend journeys for policy issuance, achieving a high uptime rate of over 99% and increasing the policy issuance speed from 1200-1300 policies per hour to more than 5000 policies per hour.",
        " Designed and developed a highly efficient microservice using pub-sub principles and GRPC for processing Salesforce platform events. This led to a streamlined and scalable solution that improved event processing speed by 60% and reduced downtime by nearly 90%.",
        "Skills: OOPS · Java · Spring boot · MongoDb · REST APIs · Typescript · Microservices· NestJs· Redis"
      ]
    },
    {
      "company": "Bajaj Finserv Health, Pune",
      "position": "SDE Intern",
      "duration": "Aug'2022 - June'2023",
      "desc": [
        "Migrated module to highly maintained apache HttpClient, this improved the APM visibility by 90% fixing memory leak issues upto 50% of the module.",
        " Ensured TDD throughout the process using JUnit and Mockito, significantly improving code coverage from 6% to 83%",
        " Integrated KEDA into the application’s Kubernetes deployment to dynamically scale resources based on workload demands.",
        "Skills: OOPS · Java · Spring boot · MongoDb · REST APIs · OAuth · Microservices"
      ]
    },
    {
      "company": "ChessBase India",
      "position": "Web Developer Intern",
      "duration": "Jan'2022 - Mar'2022",
      "desc": [
        "Worked on a fullstack educational chess platform that is designed to support the development of chess players of all ratings.","Restructured and developed the frontend by making it more interactive and user friendly,made several resusable and tested components for the frontend part."," I also modified and developed the backend apis for move verification and user authentication and integrated it throughout the project.Stack used: NextJS, ReactJS , StoryBookUI and Nodejs.",
        "Worked on building the product from scratch and built multiple dashboards.",
        "Skills: HTML · CSS · JavaScript · TailwindCSS · ReactJS · NodeJS · MongoDb · REST APIs · NextJs"
      ]
    } , 
    {
      "company": "TDPVista",
      "position": "Frontend Intern",
      "duration": "July'2021 - September'2022",
      "desc": [
        "Designed and developed the UI for project 'TILES' using ReactJS components.",
        "Developed and integrated a real time Chat application in the project using Firebase.",
        "Organized and created many reusable components for further expansion of the project.",
        "Restructured and optimized their previous project 'Studios'.",
        "Skills: HTML · CSS · JavaScript · MaterialUI · ReactJS"
      ]
    }
  ]
}
